In [ ]:
%load_ext sql

In [17]:
import pandas as pd 
import seaborn as sns
import sqlite3

con = sqlite3.connect("FinalDB.db")
cur = con.cursor()

%sql sqlite:///FinalDB.db

chicago_census_data_path= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-010"
chicago_public_schools_path = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"
chicago_crime_data_path = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"

chicago_census_data = pd.read_csv(chicago_census_data_path)
chicago_census_data.to_sql("CENSUS_DATA", con, if_exists='replace', index=False,method="multi")

chicago_public_schools = pd.read_csv(chicago_public_schools_path)
chicago_public_schools.to_sql("CHICAGO_PUBLIC_SCHOOLS", con, if_exists='replace', index=False,method="multi")

chicago_crime_data = pd.read_csv(chicago_crime_data_path)
chicago_crime_data.to_sql("CHICAGO_CRIME_DATA", con, if_exists='replace', index=False,method="multi")

533

In [20]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///FinalDB.db
Done.

[('CENSUS_DATA',), ('CHICAGO_PUBLIC_SCHOOLS',), ('CHICAGO_CRIME_DATA',)]

In [27]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_CRIME_DATA');

 * sqlite:///FinalDB.db
Done.

[('ID', 'INTEGER', 7),
 ('CASE_NUMBER', 'TEXT', 4),
 ('DATE', 'TEXT', 4),
 ('BLOCK', 'TEXT', 4),
 ('IUCR', 'TEXT', 4),
 ('PRIMARY_TYPE', 'TEXT', 4),
 ('DESCRIPTION', 'TEXT', 4),
 ('LOCATION_DESCRIPTION', 'TEXT', 4),
 ('ARREST', 'INTEGER', 7),
 ('DOMESTIC', 'INTEGER', 7),
 ('BEAT', 'INTEGER', 7),
 ('DISTRICT', 'INTEGER', 7),
 ('WARD', 'REAL', 4),
 ('COMMUNITY_AREA_NUMBER', 'REAL', 4),
 ('FBICODE', 'TEXT', 4),
 ('X_COORDINATE', 'REAL', 4),
 ('Y_COORDINATE', 'REAL', 4),
 ('YEAR', 'INTEGER', 7),
 ('LATITUDE', 'REAL', 4),
 ('LONGITUDE', 'REAL', 4),
 ('LOCATION', 'TEXT', 4)]

Q1

In [25]:
%%sql 

SELECT COUNT(*) FROM CHICAGO_CRIME_DATA

 * sqlite:///FinalDB.db
Done.

[(533,)]

In [26]:
%%sql 

SELECT 
    COMMUNITY_AREA_NUMBER,
    COMMUNITY_AREA_NAME
FROM CENSUS_DATA 
WHERE PER_CAPITA_INCOME < 11000

 * sqlite:///FinalDB.db
Done.

[(26.0, 'West Garfield Park'),
 (30.0, 'South Lawndale'),
 (37.0, 'Fuller Park'),
 (54.0, 'Riverdale')]

In [43]:
%%sql 
SELECT CASE_NUMBER, PRIMARY_TYPE, DESCRIPTION FROM CHICAGO_CRIME_DATA 
WHERE PRIMARY_TYPE LIKE "%MINORS%"

 * sqlite:///FinalDB.db
Done.

[]

In [50]:
%%sql 
SELECT * FROM CHICAGO_CRIME_DATA 
WHERE DESCRIPTION LIKE "%child%"
AND PRIMARY_TYPE == "KIDNAPPING"

 * sqlite:///FinalDB.db
Done.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 0, 0, 1533, 15, 29.0, 25.0, '20', 1143050.0, 1897546.0, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

In [57]:
%%sql 
SELECT COUNT(*), PRIMARY_TYPE FROM CHICAGO_CRIME_DATA 
WHERE LOCATION_DESCRIPTION LIKE "%SCHOOL%"
group by PRIMARY_TYPE

 * sqlite:///FinalDB.db
Done.

[(1, 'ASSAULT'),
 (5, 'BATTERY'),
 (1, 'CRIMINAL DAMAGE'),
 (1, 'CRIMINAL TRESPASS'),
 (2, 'NARCOTICS'),
 (2, 'PUBLIC PEACE VIOLATION')]

In [59]:
%%sql 
SELECT DISTINCT PRIMARY_TYPE FROM CHICAGO_CRIME_DATA 
WHERE LOCATION_DESCRIPTION LIKE "%SCHOOL%"

 * sqlite:///FinalDB.db
Done.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

In [ ]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS');

In [74]:
%%sql 
SELECT 
AVG(SAFETY_SCORE), 
`Elementary, Middle, or High School`
FROM CHICAGO_PUBLIC_SCHOOLS
group by `Elementary, Middle, or High School`

 * sqlite:///FinalDB.db
Done.

[(49.52038369304557, 'ES'), (49.62352941176471, 'HS'), (48.0, 'MS')]

In [75]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('CENSUS_DATA');

 * sqlite:///FinalDB.db
Done.

[('COMMUNITY_AREA_NUMBER', 'REAL', 4),
 ('COMMUNITY_AREA_NAME', 'TEXT', 4),
 ('PERCENT_OF_HOUSING_CROWDED', 'REAL', 4),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'REAL', 4),
 ('PERCENT_AGED_16__UNEMPLOYED', 'REAL', 4),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA', 'REAL', 4),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64', 'REAL', 4),
 ('PER_CAPITA_INCOME', 'INTEGER', 7),
 ('HARDSHIP_INDEX', 'REAL', 4)]

In [78]:
%%sql 

SELECT 
    COMMUNITY_AREA_NAME ,
    PERCENT_HOUSEHOLDS_BELOW_POVERTY 
FROM CENSUS_DATA
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5

 * sqlite:///FinalDB.db
Done.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

In [123]:
%%sql

WITH crime_counts AS (
    SELECT
        COUNT(COMMUNITY_AREA_NUMBER) as count,
        COMMUNITY_AREA_NUMBER
    FROM CHICAGO_CRIME_DATA
    WHERE COMMUNITY_AREA_NUMBER != 'None'
    GROUP BY COMMUNITY_AREA_NUMBER
)
SELECT
    COMMUNITY_AREA_NUMBER
FROM crime_counts
WHERE count = (SELECT MAX(count) FROM crime_counts)

 * sqlite:///FinalDB.db
Done.

[(25.0,)]

In [101]:
%%sql 

SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA 
WHERE HARDSHIP_INDEX == (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA )

 * sqlite:///FinalDB.db
Done.

[('Riverdale',)]

In [124]:
%%sql 

SELECT COMMUNITY_AREA_NAME FROM CENSUS_DATA 
WHERE COMMUNITY_AREA_NUMBER == 25

 * sqlite:///FinalDB.db
Done.

[('Austin',)]

In [122]:
%%sql
WITH crime_counts AS (
select 
COUNT(ccd.COMMUNITY_AREA_NUMBER) as count, 
ccd.COMMUNITY_AREA_NUMBER, 
cd.COMMUNITY_AREA_NAME
from CHICAGO_CRIME_DATA ccd 
LEFT JOIN CENSUS_DATA cd ON ccd.COMMUNITY_AREA_NUMBER = cd.COMMUNITY_AREA_NUMBER
)
SELECT
    COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME
FROM crime_counts
WHERE count = (SELECT MAX(count) FROM crime_counts)

 * sqlite:///FinalDB.db
Done.

[(58.0, 'Brighton Park')]